Revit 2027 API
RebarConstrainedHandle.AllowsDistanceToHostEdgeOrHostEdgeCover Method
 Checks if the RebarConstrainedHandle allows distance for a constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdge] or [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdgeCover] type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowsDistanceToHostEdgeOrHostEdgeCover()
Public Function AllowsDistanceToHostEdgeOrHostEdgeCover As Boolean
public:
bool AllowsDistanceToHostEdgeOrHostEdgeCover()
member AllowsDistanceToHostEdgeOrHostEdgeCover : unit -> bool
Return Value
Boolean
 Returns true if the RebarConstrainedHandle allows distance for a constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdge] or [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdgeCover] type, false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  The RebarConstrainedHandle doesn't allow constraint of RebarConstraintType.ToHostEdge or RebarConstraintType.ToHostEdgeCover type.
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace